Documents/РасшРТ_Рекламация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РасшРТ_Рекламация</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РасшРТ_СтатусыРекламации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПоПродажам</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПоРекламациям</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Марка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РисунокПротектора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нормослойность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DOT</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрисоединенныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/РасшРТ_РекламацияПрисоединенныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>РасшРТ_РекламацияПрисоединенныеФайлы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор - пользователь, добавивший файл</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасшРТ_Рекламация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМодификацииУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата добавления файла в базу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зашифрован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Comment>Автор - пользователь, добавивший файл</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Comment>Индекс иконки, соответствующей расширению файла, для показа в списке</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Comment>Дополнительный путь к файлу на диске (в случае если тип хранения файла - на диске)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Comment>Размер файла</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактирует</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИзвлеченияТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИзвлеченияТекстаФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстХранилище</Name>
					<Comment>Текст, извлеченный из файла - для полнотекстового поиска</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипХраненияФайла</Name>
					<Comment>Где хранятся файлы - в базе как ХранилищеЗначения или в каталоге на диске</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Том</Name>
					<Comment>Ссылка на том (в случае если тип хранения файла - на диске)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТомаХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлХранилище</Name>
					<Comment>Служебное поле для обмена файлами в РИБ</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьВерсии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/РасшРТ_Рекламация/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	ПрикрепленныеФайлыСписок.Параметры.УстановитьЗначениеПараметра("ВладелецФайла", Объект.Ссылка);
	
	// Устанавливаем путь сохранения по умолчанию (папка загрузок)
	Если ПустаяСтрока(ПутьСохраненияФайла) Тогда
		ПутьСохраненияФайла = ПолучитьПутьСохраненияПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Объект.Статус = ТекущийОбъект.Статус;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	ЗаполнитьХарактеристикиПоНоменклатуре();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьХарактеристикиПоНоменклатуре()
	
	Если НЕ ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Объект.Артикул = "";
		Объект.Марка = "";
		Объект.Типоразмер = "";
		Объект.РисунокПротектора = "";
		Возврат;
	КонецЕсли;
	
	// Получаем артикул из реквизита справочника
	Объект.Артикул = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Номенклатура, "Артикул");
	
	// Получаем дополнительные реквизиты номенклатуры
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураДопРекв.Свойство.Наименование КАК СвойствоНаименование,
	|	НоменклатураДопРекв.Значение КАК Значение
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДопРекв
	|ГДЕ
	|	НоменклатураДопРекв.Ссылка = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Объект.Номенклатура);
	
	Результат = Запрос.Выполнить();
	
	// Заполняем поля по найденным свойствам
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			// Проверяем по началу строки, так как имена могут содержать уточнения в скобках
			Если СтрНачинаетсяС(Выборка.СвойствоНаименование, "Бренд") Тогда
				
				Объект.Марка = Строка(Выборка.Значение);
				
			ИначеЕсли СтрНачинаетсяС(Выборка.СвойствоНаименование, "Размер") Тогда
				
				Объект.Типоразмер = Строка(Выборка.Значение);
				
			ИначеЕсли СтрНачинаетсяС(Выборка.СвойствоНаименование, "Рисунок") Тогда
				
				Объект.РисунокПротектора = Строка(Выборка.Значение);
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Экранирование XML-символов
//
&НаСервере
Функция ЭкранироватьXML(Знач Текст)
	
	Результат = Строка(Текст);
	Результат = СтрЗаменить(Результат, "&", "&amp;");
	Результат = СтрЗаменить(Результат, "<", "&lt;");
	Результат = СтрЗаменить(Результат, ">", "&gt;");
	Результат = СтрЗаменить(Результат, """", "&quot;");
	
	Возврат Результат;
	
КонецФункции

// Формирование XML узла ячейки с inlineStr и единым шрифтом Arial 9
//
&НаСервере
Функция ЯчейкаInlineStr(Адрес, Стиль, Значение)
	
	ТекстЗначения = ЭкранироватьXML(Значение);
	
	// Используем шрифт Arial 9 без жирности (как в шаблоне Тест_Пустой_XLSX)
	Если ПустаяСтрока(ТекстЗначения) Тогда
		Возврат СтрШаблон("<c r=""%1"" s=""%2""/>", Адрес, Строка(Стиль));
	Иначе
		// Простой формат без Rich Text (rPr) - Excel применит стиль автоматически
		Возврат СтрШаблон("<c r=""%1"" s=""%2"" t=""inlineStr""><is><t>%3</t></is></c>", Адрес, Строка(Стиль), ТекстЗначения);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура КомандаВыгрузкаXLSX(Команда)
	
	// Проверяем, записан ли документ
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОЗаписи", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, 
			"Документ не записан. Записать документ перед выгрузкой?", 
			РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	ВыполнитьВыгрузкуXLSX();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОЗаписи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Если Записать() Тогда
			ВыполнитьВыгрузкуXLSX();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПутьСохраненияФайла(Команда)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбора.Заголовок = "Выберите путь для сохранения файла рекламации";
	ДиалогВыбора.ПолноеИмяФайла = ПутьСохраненияФайла;
	ДиалогВыбора.Фильтр = "Файлы Excel (*.xlsx)|*.xlsx";
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораПутиСохранения", ЭтотОбъект);
	ДиалогВыбора.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПутиСохранения(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	//BSLLS:UnusedLocalVariable-off
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		
		ПутьСохраненияФайла = ВыбранныеФайлы[0];
		
	КонецЕсли;
	//BSLLS:UnusedLocalVariable-on
	
КонецПроцедуры

// Получение пути сохранения файла по умолчанию
//
// Возвращаемое значение:
//  Строка - полный путь к файлу в папке загрузок
//
&НаСервере
Функция ПолучитьПутьСохраненияПоУмолчанию()
	
	// Формируем имя файла
	ИмяФайла = "Рекламация";
	
	Если ЗначениеЗаполнено(Объект.Number) Тогда
		ИмяФайла = ИмяФайла + "_" + СтрЗаменить(Строка(Объект.Number), "/", "_");
	Иначе
		ИмяФайла = ИмяФайла + "_" + Формат(ТекущаяДатаСеанса(), "ДФ=yyyyMMdd_HHmmss");
	КонецЕсли;
	
	// Получаем путь к папке загрузок пользователя
	// В Windows это обычно C:\Users\{Пользователь}\Downloads
	КаталогЗагрузок = ПолучитьПапкуЗагрузок();
	
	Возврат КаталогЗагрузок + ИмяФайла + ".xlsx";
	
КонецФункции

// Получение папки загрузок текущего пользователя
//
// Возвращаемое значение:
//  Строка - путь к папке загрузок с завершающим слэшем
//
&НаСервере
Функция ПолучитьПапкуЗагрузок()
	
	// Для Windows используем переменную окружения USERPROFILE
	//BSLLS:UsingObjectNotAvailableUnix-off
	Shell = Новый COMОбъект("WScript.Shell");
	ПапкаПользователя = Shell.ExpandEnvironmentStrings("%USERPROFILE%");
	//BSLLS:UsingObjectNotAvailableUnix-on
	
	// Папка загрузок обычно находится в профиле пользователя
	ПапкаЗагрузок = ПапкаПользователя + "\Downloads\";
	
	// Проверяем существование папки, если нет - используем рабочий стол
	Файл = Новый Файл(ПапкаЗагрузок);
	
	Если НЕ Файл.Существует() Тогда
		
		// Если папка Downloads не существует, используем рабочий стол
		ПапкаЗагрузок = ПапкаПользователя + "\Desktop\";
		
	КонецЕсли;
	
	Возврат ПапкаЗагрузок;
	
КонецФункции

// Подготовка данных для замены переменных в макетах
//
// Возвращаемое значение:
//  Структура - данные для замены переменных в макетах Excel
//
&НаСервере
Функция ПолучитьДанныеДляЗаменыПеременных()
	
	ДанныеДокумента = Новый Структура;
	
	// Основные реквизиты документа - ВСЕ значения приводим к строковому типу
	// В структуре используем обычные имена, без квадратных скобок
	ДанныеДокумента.Вставить("Артикул", ?(ЗначениеЗаполнено(Объект.Артикул), Строка(Объект.Артикул), ""));
	ДанныеДокумента.Вставить("Номенклатура", ?(ЗначениеЗаполнено(Объект.Номенклатура), Строка(Объект.Номенклатура), ""));
	ДанныеДокумента.Вставить("Марка", ?(ЗначениеЗаполнено(Объект.Марка), Строка(Объект.Марка), ""));
	ДанныеДокумента.Вставить("Типоразмер", ?(ЗначениеЗаполнено(Объект.Типоразмер), Строка(Объект.Типоразмер), ""));
	ДанныеДокумента.Вставить("РисунокПротектора", ?(ЗначениеЗаполнено(Объект.РисунокПротектора), Строка(Объект.РисунокПротектора), ""));
	ДанныеДокумента.Вставить("СерийныйНомер", ?(ЗначениеЗаполнено(Объект.СерийныйНомер), Строка(Объект.СерийныйНомер), ""));
	ДанныеДокумента.Вставить("Нормослойность", ?(ЗначениеЗаполнено(Объект.Нормослойность), Строка(Объект.Нормослойность), ""));
	ДанныеДокумента.Вставить("DOT", ?(ЗначениеЗаполнено(Объект.DOT), Строка(Объект.DOT), ""));
	ДанныеДокумента.Вставить("ОГП", ?(Объект.ОГП <> 0, Строка(Формат(Объект.ОГП, "ЧДЦ=2")), ""));
	ДанныеДокумента.Вставить("ПричинаРекламации", ?(ЗначениеЗаполнено(Объект.Комментарий), Строка(Объект.Комментарий), ""));
	
	// Получаем изображения из прикрепленных файлов
	МассивИзображений = ПолучитьИзображенияИзПрикрепленныхФайлов();
	
	// Добавляем ссылки на изображения
	Для Индекс = 1 По 5 Цикл
		
		ИмяПеременной = "Pic_" + Формат(Индекс, "ЧГ=");
		
		Если Индекс <= МассивИзображений.Количество() Тогда
			
			// В sharedStrings.xml вставляем имя файла для справки
			ДанныеДокумента.Вставить(ИмяПеременной, Строка(МассивИзображений[Индекс - 1].Наименование));
			
		Иначе
			
			ДанныеДокумента.Вставить(ИмяПеременной, "");
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеДокумента;
	
КонецФункции

// Получение изображений из прикрепленных файлов
//
// Возвращаемое значение:
//  Массив из Структура - массив структур с данными изображений (первые 5 файлов)
//
&НаСервере
Функция ПолучитьИзображенияИзПрикрепленныхФайлов()
	
	МассивИзображений = Новый Массив;
	
	// Проверяем, что документ сохранен
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		// Если документ не сохранен, изображения получить невозможно
		Возврат МассивИзображений;
		
	КонецЕсли;
	
	// Расширения файлов изображений
	РасширенияИзображений = Новый Массив;
	РасширенияИзображений.Добавить("jpg");
	РасширенияИзображений.Добавить("jpeg");
	РасширенияИзображений.Добавить("png");
	РасширенияИзображений.Добавить("gif");
	РасширенияИзображений.Добавить("bmp");
	
	// Получаем прикрепленные файлы
	// Справочник создан в расширении конфигурации
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//BSLLS:NonExistingMetadataObject-off
	"ВЫБРАТЬ ПЕРВЫЕ 5
	|	Файлы.Ссылка КАК Ссылка,
	|	Файлы.Наименование КАК Наименование,
	|	Файлы.Расширение КАК Расширение,
	|	Файлы.ФайлХранилище КАК ФайлХранилище,
	|	Файлы.ПутьКФайлу КАК ПутьКФайлу,
	|	Файлы.ТипХраненияФайла КАК ТипХраненияФайла
	|ИЗ
	|	Справочник.РасшРТ_РекламацияПрисоединенныеФайлы КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла = &ВладелецФайла
	|	И НЕ Файлы.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Файлы.ДатаСоздания";
	//BSLLS:NonExistingMetadataObject-on
	
	Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			// Проверяем, что это изображение
			РасширениеБезТочки = СтрЗаменить(НРег(Выборка.Расширение), ".", "");
			
			Если РасширенияИзображений.Найти(РасширениеБезТочки) <> Неопределено Тогда
				
				ДвоичныеДанные = Неопределено;
				СпособПолучения = "";
				
				// Проверяем тип хранения файла
				Если ЗначениеЗаполнено(Выборка.ФайлХранилище) Тогда
					
					// Файл хранится в базе данных
					Попытка
						ДвоичныеДанные = Выборка.ФайлХранилище.Получить();
						СпособПолучения = "ФайлХранилище.Получить()";
					Исключение
						СпособПолучения = "ФайлХранилище.Получить() - ОШИБКА: " + ОписаниеОшибки();
					КонецПопытки;
					
				КонецЕсли;
				
				// Если не получилось через хранилище, пробуем через РаботаСФайлами
				Если ДвоичныеДанные = Неопределено Тогда
					
					Попытка
						ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Ссылка);
						СпособПолучения = "РаботаСФайлами.ДвоичныеДанныеФайла()";
					Исключение
						СпособПолучения = СпособПолучения + "; РаботаСФайлами - ОШИБКА: " + ОписаниеОшибки();
					КонецПопытки;
					
				КонецЕсли;
				
				// Если есть путь к файлу, пробуем напрямую
				Если ДвоичныеДанные = Неопределено И ЗначениеЗаполнено(Выборка.ПутьКФайлу) Тогда
					
					Попытка
						ДвоичныеДанные = Новый ДвоичныеДанные(Выборка.ПутьКФайлу);
						СпособПолучения = "Путь:" + Выборка.ПутьКФайлу;
					Исключение
						СпособПолучения = СпособПолучения + "; Путь - ОШИБКА: " + ОписаниеОшибки();
					КонецПопытки;
					
				КонецЕсли;
				
				Если ДвоичныеДанные <> Неопределено Тогда
					
					СтруктураФайла = Новый Структура;
					СтруктураФайла.Вставить("Ссылка", Выборка.Ссылка);
					СтруктураФайла.Вставить("Наименование", Выборка.Наименование);
					СтруктураФайла.Вставить("Расширение", Выборка.Расширение);
					СтруктураФайла.Вставить("ДвоичныеДанные", ДвоичныеДанные);
					
					МассивИзображений.Добавить(СтруктураФайла);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	Возврат МассивИзображений;
	
КонецФункции

// Получение макета с заменой переменных
//
// Параметры:
//  ИмяМакета - Строка - имя макета документа
//  ДанныеДляЗамены - Структура - данные для замены переменных
//
// Возвращаемое значение:
//  ТекстовыйДокумент, ДвоичныеДанные - макет с заменой переменных
//
&НаСервере
Функция ПолучитьМакетСЗаменойПеременных(Знач ИмяМакета, Знач ДанныеДляЗамены)
	
	// Получаем исходный макет
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет(ИмяМакета);
	
	// Если это текстовый макет - производим замену
	Если ТипЗнч(Макет) = Тип("ТекстовыйДокумент") Тогда

		// Специальная обработка листа: заполняем значения прямо в ячейки B5..L5 как inlineStr
		Если ИмяМакета = "xl_worksheets_sheet1_xml" Тогда
			ТекстМакета = Макет.ПолучитьТекст();
			
			// Карта: адрес -> {стиль_из_шаблона, новый_стиль, имя переменной}
			// ВАЖНО: используем стили из шаблона для правильной замены!
			Карта = Новый Соответствие;
			// Строка 4 теперь - первая строка данных (была строка 5)
			Карта.Вставить("B4", Новый Структура("СтильШаблона,Стиль,Поле", 2, 2, "Артикул"));
			Карта.Вставить("C4", Новый Структура("СтильШаблона,Стиль,Поле", 2, 2, "Номенклатура"));
			Карта.Вставить("D4", Новый Структура("СтильШаблона,Стиль,Поле", 2, 2, "Марка"));
			Карта.Вставить("E4", Новый Структура("СтильШаблона,Стиль,Поле", 2, 2, "Типоразмер"));
			Карта.Вставить("F4", Новый Структура("СтильШаблона,Стиль,Поле", 2, 2, "РисунокПротектора"));
			// G4 в шаблоне имеет стиль 3, но мы хотим унифицировать на стиль 2
			Карта.Вставить("G4", Новый Структура("СтильШаблона,Стиль,Поле", 3, 2, "СерийныйНомер"));
			Карта.Вставить("H4", Новый Структура("СтильШаблона,Стиль,Поле", 2, 2, "Нормослойность"));
			Карта.Вставить("J4", Новый Структура("СтильШаблона,Стиль,Поле", 2, 2, "DOT"));
			Карта.Вставить("K4", Новый Структура("СтильШаблона,Стиль,Поле", 10, 10, "ОГП"));
			Карта.Вставить("L4", Новый Структура("СтильШаблона,Стиль,Поле", 1, 1, "ПричинаРекламации"));
			
			Для Каждого Пара Из Карта Цикл
				
				Адрес = Пара.Ключ;
				Структ = Пара.Значение;
				Значение = "";
				
				// Получаем значение из структуры по имени поля
				Если ДанныеДляЗамены.Свойство(Структ.Поле, Значение) Тогда
					
					Если Значение = Неопределено Тогда
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
				
				// Ищем ячейку в шаблоне по адресу и стилю из шаблона
				ШаблонСтиль = Структ.СтильШаблона;
				НовыйСтиль = Структ.Стиль;
				
				НовыйФрагмент = ЯчейкаInlineStr(Адрес, НовыйСтиль, Значение);
				
				// Ищем начало тега ячейки с нужным адресом и стилем
				// Может быть: <c r="G5" s="3"/> или <c r="G5" s="3"><v>...</v></c> или <c r="G5" s="3"></c>
				НачалоПоиск = СтрШаблон("<c r=""%1"" s=""%2""", Адрес, Строка(ШаблонСтиль));
				НачалоПозиция = СтрНайти(ТекстМакета, НачалоПоиск);
				
				Если НачалоПозиция > 0 Тогда
					// Находим конец ячейки (самозакрывающийся тег или закрывающий тег)
					ПозицияПослеНачала = НачалоПозиция + СтрДлина(НачалоПоиск);
					
					// Проверяем, самозакрывающийся ли тег (/>)
					Если Сред(ТекстМакета, ПозицияПослеНачала, 2) = "/>" Тогда
						// Самозакрывающийся тег: <c r="G5" s="3"/>
						СтарыйФрагмент = Сред(ТекстМакета, НачалоПозиция, ПозицияПослеНачала + 2 - НачалоПозиция);
						ТекстМакета = СтрЗаменить(ТекстМакета, СтарыйФрагмент, НовыйФрагмент);
					Иначе
						// Тег с содержимым: <c r="G5" s="3">...</c>
						КонецПозиция = СтрНайти(ТекстМакета, "</c>", НачалоПозиция);
						Если КонецПозиция > 0 Тогда
							СтарыйФрагмент = Сред(ТекстМакета, НачалоПозиция, КонецПозиция - НачалоПозиция + 4);
							ТекстМакета = СтрЗаменить(ТекстМакета, СтарыйФрагмент, НовыйФрагмент);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			НовыйМакет = Новый ТекстовыйДокумент;
			НовыйМакет.УстановитьТекст(ТекстМакета);
			Возврат НовыйМакет;
		КонецЕсли;
		
		ТекстМакета = Макет.ПолучитьТекст();
		
		// Заменяем все переменные
		// В макете переменные в формате [ИмяПеременной] внутри XML-тегов <t>[Переменная]</t>
		Для Каждого Элемент Из ДанныеДляЗамены Цикл
			
			// Формируем переменную с квадратными скобками для поиска в тексте
			ПеременнаяВТексте = "[" + Элемент.Ключ + "]";
			ЗначениеЗамены = ЭкранироватьXML(Элемент.Значение);
			
			// Выполняем замену всех вхождений
			ТекстМакета = СтрЗаменить(ТекстМакета, ПеременнаяВТексте, ЗначениеЗамены);
			
		КонецЦикла;
		
		// Создаём новый текстовый документ с заменёнными значениями
		НовыйМакет = Новый ТекстовыйДокумент;
		НовыйМакет.УстановитьТекст(ТекстМакета);
		
		Возврат НовыйМакет;
		
	Иначе
		// Для бинарных макетов возвращаем как есть
		Возврат Макет;
	КонецЕсли;
	
КонецФункции

// Выполнение выгрузки XLSX
//
&НаКлиенте
Процедура ВыполнитьВыгрузкуXLSX()
	
	// Проверяем путь сохранения
	Если ПустаяСтрока(ПутьСохраненияФайла) Тогда
		ПоказатьПредупреждение(, "Укажите путь для сохранения файла!");
		Возврат;
	КонецЕсли;
	
	Попытка
		// Получаем данные для замены с сервера
		ДанныеДляЗамены = ПолучитьДанныеДляЗаменыПеременных();
		
		// Генерируем файл
		СформироватьФайлXLSX(ПутьСохраненияФайла, ДанныеДляЗамены);
		
		// Проверяем, что файл создан
		Файл = Новый Файл(ПутьСохраненияФайла);
		Если НЕ Файл.Существует() Тогда
			ПоказатьПредупреждение(, "Не удалось создать файл: " + ПутьСохраненияФайла);
			Возврат;
		КонецЕсли;
		
		// Открываем файл
		//BSLLS:ExternalAppStarting-off
		ЗапуститьПриложение(ПутьСохраненияФайла);
		//BSLLS:ExternalAppStarting-on
		
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ПоказатьПредупреждение(, "Ошибка при выгрузке файла: " + ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Генерация XML для drawing2.xml с картинками
//
// Параметры:
//  МассивИзображений - Массив - массив структур с данными изображений
//
// Возвращаемое значение:
//  Строка - XML содержимое drawing2.xml
//
&НаСервере
Функция СформироватьDrawing2XML(МассивИзображений)
	
	ПС = Символы.ПС;
	
	Результат = "<?xml version=""1.0"" encoding=""UTF-8"" standalone=""yes""?>" + ПС;
	Результат = Результат + "<xdr:wsDr xmlns:xdr=""http://schemas.openxmlformats.org/drawingml/2006/spreadsheetDrawing"" xmlns:a=""http://schemas.openxmlformats.org/drawingml/2006/main"">";
	
	Карта = Новый Массив;
	Карта.Добавить(Новый Структура("Колонка, Строка", 0, 1));
	Карта.Добавить(Новый Структура("Колонка, Строка", 1, 1));
	Карта.Добавить(Новый Структура("Колонка, Строка", 0, 3));
	Карта.Добавить(Новый Структура("Колонка, Строка", 1, 3));
	Карта.Добавить(Новый Структура("Колонка, Строка", 0, 5));
	
	Для Индекс = 0 По МИН(МассивИзображений.Количество() - 1, 4) Цикл
		
		Позиция = Карта[Индекс];
		НомерКартинки = Индекс + 1;
		
		Результат = Результат + "<xdr:twoCellAnchor editAs=""oneCell"">";
		Результат = Результат + "<xdr:from>";
		Результат = Результат + "<xdr:col>" + Строка(Позиция.Колонка) + "</xdr:col>";
		Результат = Результат + "<xdr:colOff>0</xdr:colOff>";
		Результат = Результат + "<xdr:row>" + Строка(Позиция.Строка) + "</xdr:row>";
		Результат = Результат + "<xdr:rowOff>0</xdr:rowOff>";
		Результат = Результат + "</xdr:from>";
		
		Результат = Результат + "<xdr:to>";
		Результат = Результат + "<xdr:col>" + Строка(Позиция.Колонка) + "</xdr:col>";
		Результат = Результат + "<xdr:colOff>5000625</xdr:colOff>";
		Результат = Результат + "<xdr:row>" + Строка(Позиция.Строка) + "</xdr:row>";
		Результат = Результат + "<xdr:rowOff>3750469</xdr:rowOff>";
		Результат = Результат + "</xdr:to>";
		
		Результат = Результат + "<xdr:pic>";
		Результат = Результат + "<xdr:nvPicPr>";
		Результат = Результат + "<xdr:cNvPr id=""" + Строка(НомерКартинки * 2 + 1) + """ name=""Рисунок " + Строка(НомерКартинки) + """/>";
		Результат = Результат + "<xdr:cNvPicPr><a:picLocks noChangeAspect=""1""/></xdr:cNvPicPr>";
		Результат = Результат + "</xdr:nvPicPr>";
		
		Результат = Результат + "<xdr:blipFill>";
		Результат = Результат + "<a:blip xmlns:r=""http://schemas.openxmlformats.org/officeDocument/2006/relationships"" r:embed=""rId" + Строка(НомерКартинки) + """/>";
		Результат = Результат + "<a:stretch><a:fillRect/></a:stretch>";
		Результат = Результат + "</xdr:blipFill>";
		
		Результат = Результат + "<xdr:spPr>";
		Результат = Результат + "<a:xfrm>";
		Результат = Результат + "<a:off x=""0"" y=""0""/>";
		Результат = Результат + "<a:ext cx=""5000625"" cy=""3750469""/>";
		Результат = Результат + "</a:xfrm>";
		Результат = Результат + "<a:prstGeom prst=""rect""><a:avLst/></a:prstGeom>";
		Результат = Результат + "</xdr:spPr>";
		
		Результат = Результат + "</xdr:pic>";
		Результат = Результат + "<xdr:clientData/>";
		Результат = Результат + "</xdr:twoCellAnchor>";
		
	КонецЦикла;
	
	Результат = Результат + "</xdr:wsDr>";
	
	Возврат Результат;
	
КонецФункции

// Генерация XML для drawing2.xml.rels
//
// Параметры:
//  МассивИзображений - Массив - массив структур с данными изображений
//
// Возвращаемое значение:
//  Строка - XML содержимое drawing2.xml.rels
//
&НаСервере
Функция СформироватьDrawing2Rels(МассивИзображений)
	
	ПС = Символы.ПС;
	
	Результат = "<?xml version=""1.0"" encoding=""UTF-8"" standalone=""yes""?>" + ПС;
	Результат = Результат + "<Relationships xmlns=""http://schemas.openxmlformats.org/package/2006/relationships"">";
	
	Для Индекс = 0 По МИН(МассивИзображений.Количество() - 1, 4) Цикл
		
		НомерКартинки = Индекс + 1;
		ДанныеКартинки = МассивИзображений[Индекс];
		РасширениеБезТочки = СтрЗаменить(НРег(ДанныеКартинки.Расширение), ".", "");
		
		Результат = Результат + "<Relationship Id=""rId" + Строка(НомерКартинки) + """ ";
		Результат = Результат + "Type=""http://schemas.openxmlformats.org/officeDocument/2006/relationships/image"" ";
		Результат = Результат + "Target=""../media/image" + Строка(НомерКартинки) + "." + РасширениеБезТочки + """/>";
		
	КонецЦикла;
	
	Результат = Результат + "</Relationships>";
	
	Возврат Результат;
	
КонецФункции

// Получение макета sheet2.xml с ссылкой на drawing
//
// Возвращаемое значение:
//  Строка - XML содержимое sheet2.xml
//
&НаСервере
Функция ПолучитьМакетSheet2СDrawing()
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("xl_worksheets_sheet2_xml");
	ТекстМакета = Макет.ПолучитьТекст();
	ТекстМакета = СтрЗаменить(ТекстМакета, "</worksheet>", "<drawing r:id=""rId1""/></worksheet>");
	
	Возврат ТекстМакета;
	
КонецФункции

// Копирование изображений во временную папку media
//
// Параметры:
//  КаталогMedia - Строка - путь к папке xl\media
//  МассивИзображений - Массив - массив структур с данными изображений (С ДВОИЧНЫМИ ДАННЫМИ!)
//
&НаСервере
Процедура КопироватьИзображенияВMedia(КаталогMedia, МассивИзображений)
	
	Для Индекс = 0 По МИН(МассивИзображений.Количество() - 1, 4) Цикл
		
		НомерКартинки = Индекс + 1;
		ДанныеКартинки = МассивИзображений[Индекс];
		РасширениеБезТочки = СтрЗаменить(НРег(ДанныеКартинки.Расширение), ".", "");
		ДвоичныеДанные = ДанныеКартинки.ДвоичныеДанные;
		
		Если ДвоичныеДанные <> Неопределено Тогда
			
			ИмяФайла = "image" + Строка(НомерКартинки) + "." + РасширениеБезТочки;
			ПутьКФайлу = КаталогMedia + ИмяФайла;
			ДвоичныеДанные.Записать(ПутьКФайлу);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Формирование файла XLSX
// 
&НаСервере
Процедура СформироватьФайлXLSX(ПутьКФайлу, ДанныеДляЗамены)
	
	КаталогВременных = ПолучитьИмяВременногоФайла() + "\";
	СоздатьКаталог(КаталогВременных);
	МассивИзображений = ПолучитьИзображенияИзПрикрепленныхФайлов();
	
	Попытка
		ЗаписатьМакетСЗаменой("Content_Types_xml", КаталогВременных + "[Content_Types].xml", ДанныеДляЗамены);
	
	СоздатьКаталог(КаталогВременных + "_rels");
		ЗаписатьМакетСЗаменой("_rels_rels", КаталогВременных + "_rels\.rels", ДанныеДляЗамены);
	
	СоздатьКаталог(КаталогВременных + "docProps");
		ЗаписатьМакетСЗаменой("docProps_app_xml", КаталогВременных + "docProps\app.xml", ДанныеДляЗамены);
		ЗаписатьМакетСЗаменой("docProps_core_xml", КаталогВременных + "docProps\core.xml", ДанныеДляЗамены);
		ЗаписатьМакетСЗаменой("docProps_custom_xml", КаталогВременных + "docProps\custom.xml", ДанныеДляЗамены);
	
	СоздатьКаталог(КаталогВременных + "xl");
	
		// ВАЖНО: В этом макете происходит замена переменных!
		ЗаписатьМакетСЗаменой("xl_sharedStrings_xml", КаталогВременных + "xl\sharedStrings.xml", ДанныеДляЗамены);
		
		ЗаписатьМакетСЗаменой("xl_styles_xml", КаталогВременных + "xl\styles.xml", ДанныеДляЗамены);
		ЗаписатьМакетСЗаменой("xl_workbook_xml", КаталогВременных + "xl\workbook.xml", ДанныеДляЗамены);
	
	СоздатьКаталог(КаталогВременных + "xl\_rels");
		ЗаписатьМакетСЗаменой("xl_rels_workbook_xml_rels", КаталогВременных + "xl\_rels\workbook.xml.rels", ДанныеДляЗамены);
	
	СоздатьКаталог(КаталогВременных + "xl\drawings");
		ЗаписатьМакетСЗаменой("xl_drawings_drawing1_xml", КаталогВременных + "xl\drawings\drawing1.xml", ДанныеДляЗамены);
	
	СоздатьКаталог(КаталогВременных + "xl\drawings\_rels");
		ЗаписатьМакетСЗаменой("xl_drawings_rels_drawing1_xml_rels", КаталогВременных + "xl\drawings\_rels\drawing1.xml.rels", ДанныеДляЗамены);
	
	СоздатьКаталог(КаталогВременных + "xl\media");
		ЗаписатьМакетСЗаменой("xl_media_image1_png", КаталогВременных + "xl\media\image1.png", ДанныеДляЗамены);
	
	СоздатьКаталог(КаталогВременных + "xl\printerSettings");
		ЗаписатьМакетСЗаменой("xl_printerSettings_printerSettings1_bin", КаталогВременных + "xl\printerSettings\printerSettings1.bin", ДанныеДляЗамены);
	
	СоздатьКаталог(КаталогВременных + "xl\theme");
		ЗаписатьМакетСЗаменой("xl_theme_theme1_xml", КаталогВременных + "xl\theme\theme1.xml", ДанныеДляЗамены);
	
	СоздатьКаталог(КаталогВременных + "xl\worksheets");
		ЗаписатьМакетСЗаменой("xl_worksheets_sheet1_xml", КаталогВременных + "xl\worksheets\sheet1.xml", ДанныеДляЗамены);
		
		Если МассивИзображений.Количество() > 0 Тогда
			
			Sheet2XML = ПолучитьМакетSheet2СDrawing();
			ЗаписатьТекстВФайлНаСервере(КаталогВременных + "xl\worksheets\sheet2.xml", Sheet2XML);
			
			СоздатьКаталог(КаталогВременных + "xl\worksheets\_rels");
			ЗаписатьМакетСЗаменой("xl_worksheets_rels_sheet1_xml_rels", КаталогВременных + "xl\worksheets\_rels\sheet1.xml.rels", ДанныеДляЗамены);
			ЗаписатьМакетСЗаменой("xl_worksheets_rels_sheet2_xml_rels", КаталогВременных + "xl\worksheets\_rels\sheet2.xml.rels", ДанныеДляЗамены);
			
			Drawing2XML = СформироватьDrawing2XML(МассивИзображений);
			ЗаписатьТекстВФайлНаСервере(КаталогВременных + "xl\drawings\drawing2.xml", Drawing2XML);
			
			Drawing2Rels = СформироватьDrawing2Rels(МассивИзображений);
			ЗаписатьТекстВФайлНаСервере(КаталогВременных + "xl\drawings\_rels\drawing2.xml.rels", Drawing2Rels);
			
			КопироватьИзображенияВMedia(КаталогВременных + "xl\media\", МассивИзображений);
			
		Иначе
			
			ЗаписатьМакетСЗаменой("xl_worksheets_sheet2_xml", КаталогВременных + "xl\worksheets\sheet2.xml", ДанныеДляЗамены);
	
	СоздатьКаталог(КаталогВременных + "xl\worksheets\_rels");
			ЗаписатьМакетСЗаменой("xl_worksheets_rels_sheet1_xml_rels", КаталогВременных + "xl\worksheets\_rels\sheet1.xml.rels", ДанныеДляЗамены);
			
		КонецЕсли;
		
		Файл = Новый Файл(ПутьКФайлу);
		Если Файл.Существует() Тогда
			
			Попытка
				УдалитьФайлы(ПутьКФайлу);
			Исключение
				ВызватьИсключение "Не удалось удалить существующий файл: " + ПутьКФайлу + Символы.ПС + 
					"Возможно, файл открыт в другой программе (например, Excel). " + Символы.ПС + 
					"Закройте файл и повторите операцию.";
			КонецПопытки;
			
		КонецЕсли;
		
		ЗаписьZIP = Новый ЗаписьZipФайла(ПутьКФайлу);
		ЗаписьZIP.Добавить(КаталогВременных + "*.*", 
			РежимСохраненияПутейZIP.СохранятьОтносительныеПути, 
			РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	ЗаписьZIP.Записать();
		ЗаписьZIP = Неопределено;
		
	Исключение
		Попытка
			УдалитьФайлы(КаталогВременных, "*.*");
			УдалитьФайлы(КаталогВременных);
		Исключение
		КонецПопытки;
		
		ВызватьИсключение;
	КонецПопытки;
	
	Попытка
	УдалитьФайлы(КаталогВременных, "*.*");
	УдалитьФайлы(КаталогВременных);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

// Запись макета с заменой переменных
//
&НаСервере
Процедура ЗаписатьМакетСЗаменой(ИмяМакета, ПутьКФайлу, ДанныеДляЗамены)
	
	// Получаем макет с заменой переменных
	Макет = ПолучитьМакетСЗаменойПеременных(ИмяМакета, ДанныеДляЗамены);
	Макет.Записать(ПутьКФайлу);
	
КонецПроцедуры

// Запись текста в файл (серверная)
//
&НаСервере
Процедура ЗаписатьТекстВФайлНаСервере(ПутьКФайлу, Текст)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(Текст);
	ТекстовыйДокумент.Записать(ПутьКФайлу, "UTF-8");
	
КонецПроцедуры


#КонецОбласти // СлужебныеПроцедурыИФункции

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	 РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	 РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	 РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
	 РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

#КонецОбласти // ОбработчикиКомандФормы
